Tekla.Structures.Filtering.DataFilterExpression
The DataFilterExpression class represents a basic data type for a filter expression.
This is a base class for other filter expressions and cannot be used directly.

Tekla.Structures.Filtering.DataFilterExpression.#ctor(System.Object)
Initializes a new instance of the DataFilterExpression class.
Value: The object to represent.

Tekla.Structures.Filtering.DataFilterExpression.#ctor(System.String,System.String,System.String,System.String)
Initializes a new instance of the DataFilterExpression class.
Name: The name of the expression.
Category: The category of the expression.
Property: The property of the expression.
LocalizationKey: The localization key of the expression.

Tekla.Structures.Filtering.DataFilterExpression.Value
Gets or sets the value to represent.

Tekla.Structures.Filtering.DataFilterExpression.ToString
Creates a string representation of the current object.
Returns: A new string representing the current object.